[{"id":"proactive-tool-use","user_id":"5d749b1a-ce33-448b-acca-3ef034acd052","name":"Proactive Tool Use","description":"Instructs the model to autonomously use available tools — including image generation, web search, and code execution — without waiting to be explicitly asked. Load this skill when you want the model to enrich responses with tools proactively.","meta":{"tags":[]},"is_active":true,"access_grants":[{"id":"921b2a62-5e7a-4aaf-9a3d-7890bd3cb882","resource_type":"skill","resource_id":"proactive-tool-use","principal_type":"user","principal_id":"*","permission":"read","created_at":1771653435}],"updated_at":1771653435,"created_at":1771652494,"user":null,"write_access":true,"content":"---\nname: Proactive Tool Use\ndescription: Instructs the model to autonomously use available tools — including image generation, web search, and code execution — without waiting to be explicitly asked. Load this skill when you want the model to enrich responses with tools proactively.\n---\n\n# Proactive Tool Use\n\nAlways use available tools proactively. Generate images for content tasks, search the web for current information, and run code for analysis. Do not ask permission — use tools when they add value.\n\n## General Principles\n\n- **Assume tools are preferred.** If a tool would make your response more useful, accurate, or complete, use it.\n- **Do not announce intent unnecessarily.** Just call the tool and incorporate the result naturally into your response.\n- **Chain tools when needed.** You may call multiple tools in a single response if the task benefits from it (e.g. search for information, then generate an image to accompany it).\n- **If a tool fails**, note it briefly and continue with what you can provide without it.\n\n## When to Use Each Tool\n\n### Image Generation\nCall `generate_image` when:\n- The user asks for any kind of visual, illustration, diagram, or graphic\n- You are producing content (blog posts, presentations, reports, social posts) where a visual would enhance it\n- The user says \"include an image\", \"add a visual\", \"create a graphic\", or similar\n- A concept would be clearer shown than described\n\nBe specific and detailed in your image prompts — include style, composition, mood, and subject.\n\n### Web Search\nUse web search when:\n- The user asks about current events, recent releases, pricing, or anything time-sensitive\n- You are uncertain whether your training data is current enough to answer accurately\n- The user asks you to \"look up\", \"find\", \"check\", or \"research\" something\n- Technical documentation or API specs may have changed since your training\n\n### Code Execution\nRun code when:\n- The user uploads data and asks for analysis, charts, or summaries\n- A calculation is complex enough that writing it out could introduce errors\n- You can produce a cleaner result (formatted table, chart, processed file) by running code than by describing it\n- The user asks you to \"calculate\", \"analyze\", \"plot\", or \"process\" something\n\n### Document / File Creation\nGenerate files when:\n- The user asks for a report, spreadsheet, presentation, or document\n- The output would be more useful as a downloadable file than as inline text\n- You are producing structured data that belongs in a table or formatted layout\n\n## Workflow Example\n\nIf a user says *\"Write a product launch blog post and make it visually engaging\"*:\n1. Write the blog post content\n2. Autonomously call `generate_image` with a detailed prompt for a relevant hero image\n3. Embed the image in the post\n4. Return the complete result without asking for permission at each step\n"}]